
def transliteration(string):
    transliteration_val = {'А': 'a', 'Б': 'b', 'В': 'v', 'Г': 'h', 'Ґ': 'g', 'Д': 'd', 'Е': 'e', 'Є': 'ye', 'Ж': 'zh',
                           'З': 'z', 'И': 'y', 'І': 'i', 'Ї': 'yi', 'Й': 'y', 'К': 'k', 'Л': 'l', 'М': 'm', 'Н': 'n',
                           'О': 'o', 'П': 'p', 'Р': 'r', 'С': 's', 'Т': 't', 'У': 'u', 'Ф': 'f', 'Х': 'kh', 'Ц': 'ts',
                           'Ч': 'ch', 'Ш': 'sh', 'Щ': 'shch', 'Ю': 'yu', 'Я': 'ya','1':'1','2':'2','3':'3','4':'4','5':'5',
                           '6':'6','7':'7','8':'8','9':'9','0':'0',
                           'а': 'a', 'б': 'b', 'в': 'v', 'г': 'h', 'ґ': 'g', 'д': 'd', 'е': 'e', 'є': 'ie', 'ж': 'zh',
                           'з': 'z', 'и': 'y', 'і': 'i', 'ї': 'i', 'й': 'i', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
                           'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'ts',
                           'ч': 'ch', 'ш': 'sh', 'щ': 'shch', 'ю': 'iu', 'я': 'ia',' ':'-','_':'_','ь':'', ',':'-', '.':'-', '*':'-', ')':'-', '(':'-'}
    new_string = ''

    for i in range(len(string)):
        try:
            new_string+=transliteration_val[string[i]]
        except KeyError:
            new_string+=string[i]



    return new_string


